function MDCalc(z) {
    //console.log(z);
    var score = 0;
    for (var key in z) {
        if (key !== "result") {
            score += z[key];
        }
    }
    Answer(score);
    let msg;
    if (score < 45) {
        msg = '零危险,只需要采用一般措施护理';
    } else if (score <= 45) {
        msg = '低度危险，需要采用标准防止跌倒措施，包括：(1)提供足够的灯光，清除病房、床旁及通道障碍;(2)保持病区地面清洁干燥，告知卫生间防滑措施（淋雨时有人陪伴）;(3)将日常物品放于患者易取处;(4)教会患者使用床头灯及呼叫器，放于可及处;(5)指导患者渐进坐起、渐进下床的方法;(6)专人陪住，患者活动时有人陪伴;(7)穿舒适的鞋及衣裤';
    } else if (score > 45) {
        msg = '高度危险，需要高危险防止跌倒措施。除一般护理措施外，还要实行标准护理：包括：(1)提供足够的灯光，清除病房、床旁及通道障碍;(2)保持病区地面清洁干燥，告知卫生间防滑措施（淋雨时有人陪伴）;(3)将日常物品放于患者易取处;(4)教会患者使用床头灯及呼叫器，放于可及处;(5)指导患者渐进坐起、渐进下床的方法;(6)专人陪住，患者活动时有人陪伴;(7)穿舒适的鞋及衣裤。同时还要采用高危险防止跌倒措施:(1) 在床头卡上做明显标记; (2)尽量将患者安置距离护士站较近病房 (3)告知家属应有专人陪护患者Δ 通知医生患者的高危情况进行有针对性的治疗;(4) 加强对患者夜间巡视;(5)将两侧四个床档抬起 ;(6)必要时限制患者活动，适当约束';
    }
    Text(msg);
}
